testcase_multiregion/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (-0.25 -0.05 -0.05)
    (0.25 -0.05 -0.05)
    (0.25 0.05 -0.05)
    (-0.25 0.05 -0.05)
    (-0.25 -0.05 0.05)
    (0.25 -0.05 0.05)
    (0.25 0.05  0.05)
    (-0.25 0.05  0.05)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 30 30) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    top
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    front
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    back
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    
    
    left
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    right
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
